<script context="module">
	import { browser, dev } from '$app/env';

	// нам не нужен JS на этой странице, хотя мы загрузим
	// это в dev, чтобы мы получили горячую замену модуля...
	export const hydrate = dev;

	// ...но если клиентский маршрутизатор уже загружен
	// (т.е. мы пришли сюда из другого места в приложении), используйте его
	export const router = browser;

	// так как здесь нет динамических данных, мы можем пререндерить
	// так, чтобы он служил статическим активом в prod
	//export const prerender = true;
</script>

<svelte:head>
	<title>О нас</title>
</svelte:head>

<div class="container pb-4 flex flex-col items-center">
  <span class="font-black text-4xl text-amber-200">
	<i>Добро пожаловать в сладкий мир зефирных цветов !</i>
  </span>
  <div class="flex items-center flex-col max-w-screen-md rounded-lg border-2 border-solid border-amber-200 bg-white p-1 mt-5">	
	<picture>
	  <img src="/20220215_171309-01.jpeg" alt="Фото" class="rounded-lg border-2 border-solid border-[#ab8c52]">
	</picture>
	
	<div class="text-left text-lg mx-4">
		<i>
		  <b>Всем привет!</b>	
		</i>
		<p>
		  <i>
		    Меня зовут Инна, и я занимаюсь зефирной флористикой. Создаю красоту, которую можно попробовать на вкус.
		  </i>
		<p>
		  <i>	
			В кондитерской деле я с 2015 года. Сначала пекла торты, капкейки, муссовые пирожные, училась работать с белковым кремом, шоколадом, но все было не то.. долго искала что-то своё, то, что действительно будет приносить мне удовольствие.
		  </i>
		</p>
		<p>
		  <i>
			И в 2018 году я случайно попала на страничку с домашним зефиром и понеслась.
			Изначально ничего не получалось, но я не сдавалась, покупала курсы, рецепты, книги, проходила марафоны и делала, делала, делала... и теперь могу похвастаться вот такими вот результатами!
		  </i>
		</p>
		<p>
		  <i>
			<b>Кстати, корзинки я тоже делаю сама.</b>  
		  </i>
		</p>
	  </div>
  </div>
</div>

<style lang="postcss">
  /*p {
    text-indent: 10px; // Отступ первой строки в пикселах 
   }*/	
</style>
